#  ____                     __ _ _
# | __ ) _ __ _____      __/ _(_) | ___
# |  _ \| '__/ _ \ \ /\ / / |_| | |/ _ \
# | |_) | | |  __/\ V  V /|  _| | |  __/
# |____/|_|  \___| \_/\_/ |_| |_|_|\___|

cask_args appdir: '/Applications'

tap 'hombrew/cask-fonts'
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'

brew 'autojump'
brew 'awscli'
brew 'exiftool'
brew 'figlet'
brew 'fzf'
brew 'git'
brew 'heroku-toolbelt'
brew 'httpie'
brew 'mysql'
brew 'neovim'
brew 'node-build'
brew 'nodenv'
brew 'node'
brew 'postgresql'
brew 'rbenv'
brew 'readline'
brew 'ruby-build'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'zsh'
brew 'bat'

cask '1password'
cask 'alfred'
cask 'datagrip'
cask 'dropbox'
cask 'docker'
cask 'evernote'
cask 'expressvpn'
cask 'firefox'
cask 'font-courier-prime-code'
cask 'font-fira-code'
cask 'font-source-code-pro'
cask 'font-cascadia'
cask 'gitup'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'hazel'
cask 'iterm2'
cask 'licecap'
cask 'little-snitch'
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'signal'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'tor-browser'
cask 'visual-studio-code'
cask 'virtualbox'
cask 'vlc'
cask 'postman'

mas 'amphetamine', id: 937984704
mas 'deliveries', id: 924726344
mas 'focus to-do', id: 1258530160
mas 'moom', id: 419330170
