#  ____                     __ _ _
# | __ ) _ __ _____      __/ _(_) | ___
# |  _ \| '__/ _ \ \ /\ / / |_| | |/ _ \
# | |_) | | |  __/\ V  V /|  _| | |  __/
# |____/|_|  \___| \_/\_/ |_| |_|_|\___|

cask_args appdir: '/Applications'

tap 'homebrew/cask-fonts'
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'heroku/brew'

brew 'archey'
brew 'autojump'
brew 'awscli'
brew 'direnv'
brew 'exiftool'
brew 'figlet'
brew 'fzf'
brew 'git'
brew 'git-delta'
brew 'git-extras'
brew 'heroku'
brew 'htop'
brew 'httpie'
brew 'mysql'
brew 'neovim'
brew 'node-build'
brew 'nodenv'
brew 'node'
brew 'postgresql'
brew 'rbenv'
brew 'readline'
brew 'ripgrep'
brew 'ruby-build'
brew 'shellcheck'
brew 'starship'
brew 'tig'
brew 'thefuck'
brew 'the_silver_searcher'
brew 'tmux'
brew 'trash'
brew 'tree'
# brew 'zplug' # Maybe start using this https://github.com/zplug/zplug
brew 'zsh'
brew 'bat'

cask '1password'
cask 'alfred'
cask 'authy'
cask 'cyberduck'
cask 'datagrip'
cask 'discord'
cask 'dropbox'
cask 'docker'
cask 'expressvpn'
cask 'firefox'
cask 'homebrew/cask-versions/firefox-developer-edition'
cask 'font-courier-prime-code'
cask 'font-fira-code'
cask 'font-source-code-pro'
cask 'font-cascadia-code'
cask 'font-caskaydia-cove-nerd-font'
cask 'gitup'
cask 'google-chrome'
cask 'gpg-suite'
cask 'hazel'
cask 'iterm2'
cask 'licecap'
cask 'little-snitch'
cask 'macdown'
cask 'postman'
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'rocket'
cask 'signal'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'tor-browser'
cask 'visual-studio-code'
cask 'virtualbox'
cask 'vlc'
cask 'xld'
cask 'zoom'

mas 'amphetamine', id: 937984704
mas 'deliveries', id: 924726344
# mas 'hand mirror', id: 1502839586
mas 'focus to-do', id: 1258530160
mas 'moom', id: 419330170
mas 'twitter', id: 1482454543
