#  ____                     __ _ _
# | __ ) _ __ _____      __/ _(_) | ___
# |  _ \| '__/ _ \ \ /\ / / |_| | |/ _ \
# | |_) | | |  __/\ V  V /|  _| | |  __/
# |____/|_|  \___| \_/\_/ |_| |_|_|\___|

cask_args appdir: '/Applications'

tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'
tap 'homebrew/services'

brew 'archey4'
brew 'autojump'
brew 'awscli'
brew 'bat'
brew 'direnv'
brew 'exiftool'
brew 'figlet'
brew 'fzf'
brew 'git'
brew 'git-delta'
brew 'git-extras'
brew 'htop'
brew 'httpie'
brew 'libfido2'
brew 'mas'
brew 'mysql'
brew 'neovim'
brew 'node-build'
brew 'nodenv'
brew 'node'
brew 'opensc'
brew 'pinentry-mac'
brew 'postgresql'
brew 'rbenv'
brew 'readline'
brew 'ripgrep'
brew 'ruby-build'
brew 'shellcheck'
brew 'starship'
brew 'tig'
brew 'thefuck'
brew 'the_silver_searcher'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'ykman'
# brew 'zplug' # Maybe start using this https://github.com/zplug/zplug
brew 'zsh'

cask '1password'
cask '1password-cli'
cask 'android-studio'
cask 'alfred'
cask 'arc'
cask 'authy'
cask 'balenaetcher'
# cask 'cyberduck'
cask 'datagrip'
cask 'discord'
cask 'dropbox'
cask 'docker'
cask 'expressvpn'
cask 'firefox'
cask 'homebrew/cask-versions/firefox-developer-edition'
cask 'font-courier-prime-code'
cask 'font-fira-code'
cask 'font-source-code-pro'
cask 'font-cascadia-code'
cask 'font-caskaydia-cove-nerd-font'
cask 'gitup'
cask 'google-chrome'
cask 'gpg-suite'
cask 'iterm2'
cask 'little-snitch'
cask 'obsidian'
cask 'postman'
cask 'slack'
cask 'sonos'
cask 'spotify'
cask 'the-unarchiver'
cask 'tor-browser'
cask 'visual-studio-code'
cask 'vlc'
cask 'xld'
cask 'zoom'

mas 'amphetamine', id: 937984704
mas 'deliveries', id: 290986013
mas 'focus to-do', id: 1258530160
mas 'moom', id: 419330170
mas 'xcode', id: 497799835
