#  ____                     __ _ _
# | __ ) _ __ _____      __/ _(_) | ___
# |  _ \| '__/ _ \ \ /\ / / |_| | |/ _ \
# | |_) | | |  __/\ V  V /|  _| | |  __/
# |____/|_|  \___| \_/\_/ |_| |_|_|\___|

cask_args appdir: '/Applications'

brew 'awscli'
brew 'chroma'
brew 'btop'
brew 'direnv'
brew 'exiftool'
brew 'figlet'
brew 'git'
brew 'git-delta'
brew 'git-extras'
brew 'lazygit'
brew 'libfido2'
brew 'mas'
brew 'ollama'
brew 'pinentry-mac'
brew 'postgresql'
brew 'readline'
brew 'shellcheck'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'zsh'

cask '1password'
cask 'anki'
cask 'arc'
cask 'authy'
cask 'balenaetcher'
cask 'datagrip'
cask 'discord'
cask 'dropbox'
cask 'docker-desktop'
cask 'expressvpn'
cask 'figma'
cask 'firefox'
cask 'font-cascadia-code'
cask 'font-cascadia-code-nf'
cask 'font-caskaydia-cove-nerd-font'
cask 'google-chrome'
cask 'gpg-suite'
cask 'iterm2'
cask 'obsidian'
cask 'postman'
cask 'rubymine'
cask 'slack'
cask 'sonos'
cask 'spotify'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'vlc'
cask 'xld'
cask 'zoom'

mas 'amphetamine', id: 937984704
mas 'deliveries', id: 290986013
mas 'focus to-do', id: 1258530160
mas 'moom', id: 419330170
mas 'xcode', id: 497799835
